Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When using the https://micrometer.io/[Micrometer's] Quarkiverse OTLP registry to push metrics to Grafana OTel LGTM, the `quarkus.micrometer.export.otlp.url` property is automatically set to OTel collector endpoint as seen from the outside of the Docker container.
ja_jp: https://micrometer.io/[Micrometer] の Quarkiverse OTLP レジストリーを使用してメトリクスを Grafana OTel LGTM にプッシュする場合、Docker コンテナーの外部から見える OTel コレクターエンドポイントに `quarkus.micrometer.export.otlp.url` プロパティーが自動的に設定されます。

source: When using the imperative model, Quarkus associates a worker thread to each processing unit (like an HTTP request or a gRPC invocation). That thread is dedicated to this specific processing until the processing completes. Thus, you can use _Thread Locals_ to propagate data along the processing, and no other processing unit will use that thread until the completion of the current one.
ja_jp: 命令型モデルを使用する場合、Quarkusは各処理ユニット（HTTPリクエストやgRPC呼び出しなど）にワーカースレッドを関連付けます。 このスレッドは、処理が完了するまで、この特定の処理に専念します。 したがって、 _スレッドローカル_ を使用して、処理に沿ってデータを伝搬することができます。 現在の処理が完了するまで、他の処理ユニットがそのスレッドを使用することはありません。

source: When using the kotlin version of Hibernate ORM with Panache, note that the `PanacheEntity`, `PanacheQuery` and `PanacheRepository` are in a different package: `io.quarkus.hibernate.orm.panache.kotlin`.
ja_jp: kotlin版のHibernate ORM with Panacheを使用する場合、 `PanacheEntity`, `PanacheQuery`, `PanacheRepository` は、 `io.quarkus.hibernate.orm.panache.kotlin` という別のパッケージになっていることに注意してください。

source: When using the logger exporter, metrics will be printed to the console. This is a pretty printed example:
ja_jp: ロガーエクスポーターを使用すると、メトリクスがコンソールに出力されます。 以下は pretty-print の例です。

source: When using the mailer, using a _named_ configuration is required to avoid conflicts with other TLS configurations. The mailer will not use the default TLS configuration.
ja_jp: Mailer を使用する場合、他の TLS 設定との競合を避けるために、_名前付き_ の設定を使用する必要があります。 Mailer はデフォルトの TLS 設定を使用しません。

source: When using the programmatic approach for creating a REST Client, `QuarkusRestClientBuilder` provides a method named `disableDefaultMapper` that provides the same feature.
ja_jp: REST Client を作成するためのプログラム的なアプローチを使用する場合、 `QuarkusRestClientBuilder` は、同じ機能を提供する `disableDefaultMapper` という名前 のメソッドを提供します。

source: When using the reactive variant of the data source, the passed callback is a `Function<ReactiveTransactionalRedisDataSource, Uni<Void>>`:
ja_jp: データソースのリアクティブバリアントを使用する場合、渡されるコールバックは `Function<ReactiveTransactionalRedisDataSource, Uni<Void>>`: となります。

source: When using the replication mode, you need to pass a single host url and configure the type to be `replication`:
ja_jp: レプリケーションモードを使用する場合、単一のホスト URL を渡し、タイプを `replication` に設定する必要があります。

source: When using the repository pattern, you can define your entities as regular JPA entities.
ja_jp: リポジトリパターンを使用する場合、エンティティーを通常のJPAエンティティーとして定義することができます。

source: When using the repository pattern, you can define your entities as regular Jakarta Persistence entities.
ja_jp: リポジトリパターンを使用する場合、エンティティを通常のJakarta Persistenceエンティティとして定義することができます。

source: When using the repository pattern, you can define your entities as regular POJO.
ja_jp: リポジトリパターンを使用する場合は、エンティティを通常のPOJOとして定義することができます。

source: When using the separate server mode (`quarkus.grpc.server.use-separate-server=true`), you can configure the flow control window using a `ServerBuilderCustomizer`:
ja_jp: 独立サーバーモード (`quarkus.grpc.server.use-separate-server=true`) を使用する場合、`ServerBuilderCustomizer` を使用してフロー制御ウィンドウを設定できます。

source: When using the unified server mode (`quarkus.grpc.server.use-separate-server=false`), you can configure the HTTP/2 connection window size:
ja_jp: 統合サーバーモード (`quarkus.grpc.server.use-separate-server=false`) を使用する場合、HTTP/2 接続ウィンドウサイズを設定できます。

source: When using unix-socket, you need:
ja_jp: unix-socket を使用する場合、以下が必要です。

source: When using xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search], Dev Services will default to Elasticsearch or OpenSearch based on Hibernate Search configuration.
ja_jp: xref:hibernate-search-orm-elasticsearch.adoc[Hibernate Search] を使用する場合、 Dev Services は Hibernate Search の設定に基づき、使用するデフォルトを Elasticsearch または OpenSearch から選択します。

source: When using xref:resteasy_integration[quarkus-resteasy-qute] the `locale` attribute is derived from the `Accept-Language` header if not set by a user.
ja_jp: xref:resteasy_integration[quarkus-resteasy-qute] を使用する場合、ユーザーによって設定されていない場合、 `locale` 属性は `Accept-Language` ヘッダーから導出されます。

source: When verifying the opaque access token indirectly, by using it to request `UserInfo`, Quarkus will use `UserInfo` as the source of the roles information, if any. As it happens, Auth0 includes the custom role claim which was created earlier in the `UserInfo` response as well.
ja_jp: 不透明アクセストークンを間接的に検証する場合、それを使用して `UserInfo` をリクエストすると、Quarkus はロール情報のソースとして `UserInfo` を使用します (存在する場合)。その結果、Auth0 は `UserInfo` レスポンスに以前に作成されたカスタムロールクレームも含めます。

source: When we added the Hibernate Search annotations to our entities, we defined the analyzers and normalizers used. Typically:
ja_jp: エンティティにHibernate Searchアノテーションを追加する際に、使用するアナライザーとノーマライザーを定義しました。典型的には:

source: When we added the OpenShift extension to the command line invocation above, the following dependency was added to the `pom.xml`
ja_jp: 上記のコマンドライン呼び出しにOpenShift エクステンションを追加すると、以下のような依存関係が `pom.xml` に追加されます。

source: When we call `GET /conditional` the first time, we will get this response:
ja_jp: `GET /conditional` を初めて呼び出すと、このようなレスポンスが返ってきます。

source: When we call a resource `/records/1` that returns only one instance, then the output is:
ja_jp: 1 つのインスタンスのみを返すリソース `/records/1` を呼び出すと、出力は次のようになります。

source: When we initially released Quarkus, the industry was very much focused on microservices, and that was our primary target. However, Quarkus is also perfectly suited for large monoliths, whether you are migrating existing applications to a more modern runtime or building new ones from scratch.
ja_jp: Quarkusを最初にリリースしたとき、業界はマイクロサービスに大きく焦点を当てており、それが私たちの主なターゲットでした。しかし、Quarkusは、既存のアプリケーションをよりモダンなランタイムに移行する場合でも、新しいアプリケーションをゼロから構築する場合でも、大規模なモノリスにも完全に適しています。

source: When we introduced RESTEasy _reactive_, we decided to use a non-blocking approach by default: if not stated otherwise, it calls the HTTP endpoint method on the I/O thread. This model resulted in outstanding performance and was simple enough, thanks to the usage of the `@Blocking` annotation.
ja_jp: RESTEasy _reactive_ を導入したとき、デフォルトでノンブロッキングのアプローチを使用することにしました。特に明記されていない場合は、I/OスレッドでHTTPエンドポイント・メソッドを呼び出します。このモデルは優れたパフォーマンスをもたらし、 `@Blocking` アノテーションの使用により十分にシンプルなものとなりました。

source: When we worked with the first <<vertx-oidc-to-quarkus-oidc,Vertx OIDC to Quarkus OIDC migration example>>, we had to configure Quarkus OIDC to restore the original request URL, after the authorization code flow is complete.
ja_jp: 最初の <<vertx-oidc-to-quarkus-oidc,Vert.x OIDC から Quarkus OIDC への移行例>> では、認可コードフローの完了後に元のリクエスト URL を復元するように Quarkus OIDC を設定する必要がありました。

source: When working with a multi-module project, then for code coverage to work properly, the upstream modules need to be properly xref:cdi-reference.adoc#bean_discovery[indexed].
ja_jp: マルチモジュールのプロジェクトを扱う場合、コードカバレッジが適切に機能するためには、上流のモジュールが適切に xref:cdi-reference.adoc#bean_discovery[インデックスされている] 必要があります。

source: When working with large gRPC messages, you may need to tune the HTTP/2 flow control window size to achieve optimal throughput.
ja_jp: 大容量の gRPC メッセージを扱う場合、最適なスループットを実現するために HTTP/2 フロー制御ウィンドウサイズを調整する必要がある場合があります。

source: When working with large messages, you can configure the flow control window for gRPC clients:
ja_jp: 大容量メッセージを扱う場合、gRPC クライアントのフロー制御ウィンドウを設定できます。

source: When working with multiple persistence units, the name of the persistence unit to reindex can be supplied through the `persistence_unit` query parameter: `/q/hibernate-search/reindex?persistence_unit=non-default-persistence-unit`.
ja_jp: 複数の永続ユニットを処理する場合、再度インデックス化する永続ユニットの名前は、 `persistence_unit` クエリーパラメーター (`/q/hibernate-search/reindex?persistence_unit=non-default-persistence-unit`) を通じて提供されます。

source: When working with non-default persistence units, remember to specify the persistence unit name the repository is targeting in the `dataStore` attribute of the repository annotation:
ja_jp: デフォルト以外の永続化ユニットを操作する場合は、リポジトリーアノテーションの `dataStore` 属性で、リポジトリーがターゲットとしている永続化ユニット名を指定することを忘れないでください。

source: When working with the `quarkus-kubernetes` extension and have Kotlin classes bound to CustomResource definitions (like you do for building operators), you need to be aware that the underlying Fabric8 Kubernetes Client uses its own static Jackson `ObjectMapper` s, which can be configured as follows with the `KotlinModule`:
ja_jp: `quarkus-kubernetes` エクステンションを使用して、Kotlin クラスを CustomResource 定義にバインドする場合（オペレーターを構築する場合など）、基盤となる Fabric8 Kubernetes Client が独自の静的な Jackson `ObjectMapper` を使用することに注意する必要があります。これは `KotlinModule` を使用して以下のように設定できます:

source: When writing Quarkus extensions, it is often useful to decompile the generated source code to better understand what's going on.
ja_jp: Quarkusのエクステンションを作成する場合、生成されたソースコードを逆コンパイルすると、何が起こっているかをよりよく理解できることがよくあります。

source: When writing an extension, it's beneficial to provide health checks for the extension, that can be automatically included without the developer needing to write their own.
ja_jp: エクステンションを書くときには、開発者が自分で書かなくても自動的に含まれるようにすることができるエクステンションのヘルスチェックを提供することが有益です。

source: When writing to Redis or reading from Redis, Quarkus needs to know the type. Indeed, the objects need to be serialized and deserialized. For that purpose, you may need to configure type (class names) of the key and value you want to cache. At build time, Quarkus tries to deduce the types from the application code, but that decision can be overridden using:
ja_jp: Redisに書き込んだり、Redisから読み込んだりするとき、Quarkusは型を知っておく必要があります。実際、オブジェクトをシリアライズしたりデシリアライズしたりする必要があります。そのため、キャッシュしたいキーと値の型（クラス名）を設定する必要がある場合があります。ビルド時に、Quarkusはアプリケーションコードから型を推測しようとしますが、この決定は、以下の方法でオーバーライドできます:

source: When xDS is configured, `plain-text` is automatically disabled.
ja_jp: xDSが設定されている場合、 `plain-text` は自動的に無効化されます。

source: When xDS target property is used, name resolver, host, and port are not used
ja_jp: xDSターゲットプロパティを使用する場合、ネームリゾルバ、ホスト、ポートは使用しません。

source: When you access the `/q/health/ready` endpoint of your application you will have information about the datasource validation status. If you have multiple datasources, all datasources will be checked and the status will be `DOWN` as soon as there is one datasource validation failure.
ja_jp: アプリケーションの `/q/health/ready` エンドポイントにアクセスすると、データソースの検証ステータスに関する情報が表示されます。複数のデータソースがある場合は、すべてのデータソースがチェックされ、1 つのデータソースの検証に失敗するとすぐにステータスが `DOWN` になります。

source: When you access the `/q/health/ready` endpoint of your application you will have information about the server connection and available caches.
ja_jp: アプリケーションの `/q/health/ready` エンドポイントにアクセスすると、サーバー接続と利用可能なキャッシュの情報が表示されます。

source: When you access your application’s health readiness endpoint, `/q/health/ready` by default, you receive information about the datasource validation status. If you have multiple datasources, all datasources are checked, and if a single datasource validation failure occurs, the status changes to `DOWN`.
ja_jp: アプリケーションのヘルスチェックエンドポイント `/q/health/ready` (デフォルト) にアクセスすると、データソースの検証状況に関する情報を受け取ります。 複数のデータソースがある場合は、すべてのデータソースがチェックされ、データソースの検証に失敗した場合は、ステータスが `DOWN` に変わります。

source: When you accessed the `http://localhost:8080/protected` page the first time, the following redirects happened:
ja_jp: 初めて `http://localhost:8080/protected` ページにアクセスしたとき、以下のリダイレクトが発生しました。

source: When you add a built-in JDBC driver extension, Quarkus also adds the `quarkus-agroal` extension. Agroal provides the JDBC connection pool for built-in and custom JDBC drivers. When you use a custom JDBC driver, add `quarkus-agroal` explicitly.
ja_jp: 組み込みの JDBC ドライバーエクステンションを追加すると、Quarkus は `quarkus-agroal` エクステンションも追加します。 Agroal は、組み込みおよびカスタムの JDBC ドライバーに JDBC 接続プールを提供します。 カスタム JDBC ドライバーを使用する場合は、 `quarkus-agroal` を明示的に追加してください。

source: When you add both a JDBC extension and a reactive datasource extension for the same `db-kind`, Quarkus creates both JDBC and reactive datasources by default.
ja_jp: 同じ `db-kind` に対して JDBC エクステンションとリアクティブデータソースエクステンションの両方を追加すると、Quarkus はデフォルトで JDBC データソースとリアクティブデータソースの両方を作成します。

source: When you add the xref:telemetry-micrometer.adoc[`quarkus-micrometer`] extension, `quarkus-agroal` can publish datasource metrics to the metrics registry. To enable these metrics, set `quarkus.datasource.metrics.enabled=true`.
ja_jp: xref:telemetry-micrometer.adoc[`quarkus-micrometer`] エクステンションを追加すると、 `quarkus-agroal` はメトリクスレジストリーにデータソースメトリクスを公開できます。 これらのメトリクスを有効にするには、 `quarkus.datasource.metrics.enabled=true` を設定します。

source: When you are done with dev mode, you can run the application as a standard Java application.
ja_jp: 開発モードが完了したら、アプリケーションを標準の Java アプリケーションとして実行できます。

source: When you are exposing a `Collection` return like our `getAllFilms`, you might want to use the batch form of the above, to more efficiently fetch the heroes:
ja_jp: 今回の `getAllFilms` のように `Collection` の戻り値を公開している場合は、より効率的にヒーローを取得するために、上記のバッチ形式を使用するとよいでしょう。

source: When you combine this option with `-XX:+VerboseGC` you still get a message per GC cycle, but it contains extra information. Also, adding this option shows the sizing decisions made by the GC algorithm at startup:
ja_jp: このオプションを `-XX:+VerboseGC` と組み合わせると、GC サイクルごとにメッセージが表示されますが、これには追加の情報が含まれています。また、このオプションを追加すると、GCアルゴリズムが起動時に行ったサイジングの決定が表示されます：

source: When you compile an application into a native image, the following limitations apply to MySQL Connector/J integrations:
ja_jp: アプリケーションをネイティブイメージにコンパイルする場合、MySQL Connector/J インテグレーションには以下の制限が適用されます。

source: When you configure a _named_ TLS configuration, TLS is enabled by default.
ja_jp: _名前付き_ TLS 設定を行うと、TLS はデフォルトで有効になります。

source: When you configure a _named_ TLS configuration, TLS is enabled by default. If your SMTP server uses a valid (trusted) certificate, and thus do not require a specific TLS configuration, you need to enable TLS explicitly (as you do not have to configure a trust store):
ja_jp: 名前付き TLS 設定を設定すると、TLS はデフォルトで有効になります。 SMTP サーバーが有効な (信頼済み) 証明書を使用しており、特定の TLS 設定を必要としない場合は、TLS を明示的に有効にする必要があります (トラストストアを設定する必要がないため)。

source: When you configure multiple datasources, each `DataSource` also has the `io.quarkus.agroal.DataSource` qualifier with the datasource name as the value.
ja_jp: 複数のデータソースを設定する場合、各 `DataSource` には、データソース名を値として持つ `io.quarkus.agroal.DataSource` 修飾子も付与されます。

source: When you configure the *lifespan* parameter for entries in an Infinispan cache, you specify a time duration. After an entry has been added to the cache or accessed (read or written), it starts its lifespan countdown. If the time since the entry was created or last accessed exceeds the specified "lifespan" duration, the entry is considered expired and becomes eligible for eviction from the cache.
ja_jp: Infinispan キャッシュのエントリーに *lifespan* パラメーターを設定すると、 期間を指定します。エントリーがキャッシュに追加されるかアクセスされた (読み取りまたは書き込み) 後、そのエントリーの存続期間のカウントダウンが始まります。エントリーの 作成または最終アクセスからの経過時間が、指定された「存続期間」を超えた場合、そのエントリーは 期限切れと見なされ、キャッシュから削除の対象となります。

source: When you configure the *max-idle* parameter for entries in an Infinispan cache, you specify a time duration. After an entry has been accessed (read or written) in the cache, if there are no subsequent accesses to that entry within the specified duration, it is considered idle. Once the idle time exceeds the *max-idle* duration, the entry is considered expired and eligible for eviction from the cache.
ja_jp: Infinispan キャッシュのエントリーに *max-idle* パラメーターを設定する場合、時間を指定します。 キャッシュ内のエントリーがアクセス (読み取りまたは書き込み) された後、指定された期間内に そのエントリーに対してその後アクセスがない場合は、アイドル状態とみなされます。アイドル時間が *max-idle* 期間を超えると、エントリーは期限切れとみなされ、キャッシュからのエビクションの 対象となります。

source: When you configure the Typesafe GraphQL client with certificate reloading, as described in the <<reloading-certificates>> section, override the bean scope to `RequestScoped` or another scope shorter than the application scope. The Typesafe client is an application-scoped bean by default.
ja_jp: <<reloading-certificates>> セクションで説明されているように、証明書の再読み込みを行う Typesafe GraphQL クライアントを設定する場合、Bean スコープを `RequestScoped` またはアプリケーションスコープより短い他のスコープにオーバーライドしてください。Typesafe クライアントはデフォルトでアプリケーションスコープの Bean です。

source: When you connect to the server you can either pass in the Class of the annotated client endpoint you want to use, or an instance of `jakarta.websocket.Endpoint`. If you are using the annotated endpoint then you can use the exact same annotations as you can on the server, except it must be annotated with `@ClientEndpoint` instead of `@ServerEndpoint`.
ja_jp: サーバーに接続する際、使用するアノテーション付きクライアントエンドポイントのクラス、または `jakarta.websocket.Endpoint` のインスタンスを渡すことができます。アノテーション付きエンドポイントを使用する場合、 `@ServerEndpoint` の代わりに `@ClientEndpoint` でアノテーションする必要がありますが、サーバー上で使用できるものと全く同じアノテーションを使用することができます。

source: When you connect to the server you can either pass in the Class of the annotated client endpoint you want to use, or an instance of `javax.websocket.Endpoint`. If you are using the annotated endpoint then you can use the exact same annotations as you can on the server, except it must be annotated with `@ClientEndpoint` instead of `@ServerEndpoint`.
ja_jp: サーバーに接続する際には、使用するアノテーション付きクライアント・エンドポイントの Class で渡すか、 `javax.websocket.Endpoint` のインスタンスで渡すことができます。アノテーション付きエンドポイントを使用している場合は、サーバー上で使用できるのとまったく同じアノテーションを使用できますが、アノテーションは `@ServerEndpoint` ではなく `@ClientEndpoint` でなければなりません。

source: When you create a `Logger` instance, Quarkus keeps metadata associated with the `Logger` name in memory for the full lifecycle of the application.
ja_jp: `Logger` インスタンスを作成すると、Quarkus はアプリケーションの全ライフサイクルにわたって、その `Logger` 名に関連付けられたメタデータをメモリー内に保持します。

source: When you disable `quarkus.grpc.server.use-separate-server`, you are then using the new Vert.x gRPC server implementation which uses the existing HTTP server. Which means that the server port is now `8080` (or the port configured with `quarkus.http.port`). Also, most of the other configuration properties are no longer applied, since it's the HTTP server that should already be properly configured.
ja_jp: `quarkus.grpc.server.use-separate-server` を無効にすると、既存の HTTP サーバーを使用する新しい Vert.x gRPC サーバー実装が使用されます。つまり、サーバーのポートが `8080` (または `quarkus.http.port` で設定されたポート) になることを意味します。また、すでに適切に設定されているはずの HTTP サーバーであるため、他のほとんどの設定プロパティは適用されなくなります。

source: When you do not configure a client secret with `quarkus.oidc.credentials.secret`, it is recommended to configure `quarkus.oidc.token-state-manager.encryption-secret`.
ja_jp: `quarkus.oidc.credentials.secret` でクライアントシークレットを設定しない場合は、 `quarkus.oidc.token-state-manager.encryption-secret` を設定することをお勧めします。

source: When you do not specify a name for your database service, the the value of the `db-kind` property is used as the default name.
ja_jp: データベースサービスの名前を指定しない場合、 `db-kind` プロパティーの値がデフォルトの名前として使用されます。

source: When you do not specify a name for your database service, the value of the `db-kind` property is used as the default name.
ja_jp: データベースサービスの名前を指定しない場合、`db-kind` プロパティーの値がデフォルトの名前として使用されます。

source: When you enable `quarkus.grpc.clients."client-name".use-quarkus-grpc-client`, you are then using the new Vert.x gRPC channel implementation, so not all configuration properties can still be applied. And currently there is no Stork support yet.
ja_jp: `quarkus.grpc.clients."client-name".use-quarkus-grpc-client` を有効にすると、新しい Vert.x gRPC チャネル実装を使用することになるため、すべての設定プロパティを適用できるわけではありません。また、現在、Storkのサポートはまだありません。

source: When you enable `quarkus.grpc.clients."client-name".xds.enabled`, it's the xDS that should handle most of the configuration above.
ja_jp: `quarkus.grpc.clients."client-name".xds.enabled` を有効にすると、上記の設定のほとんどを処理するのはxDSになります。

source: When you enable `quarkus.grpc.server.xds.enabled`, it's the xDS that should handle most of the configuration above.
ja_jp: `quarkus.grpc.server.xds.enabled` を有効にすると、上記の設定のほとんどを処理するのはxDSになります。

source: When you enable this option and also add the `quarkus-opentelemetry` extension, the application can fail to start and throw a `java.lang.IllegalStateException: GlobalOpenTelemetry.set has already been called.` error.
ja_jp: このオプションを有効にし、かつ `quarkus-opentelemetry` エクステンションを追加すると、アプリケーションの起動に失敗し、 `java.lang.IllegalStateException: GlobalOpenTelemetry.set has already been called.` エラーが発生することがあります。

source: When you encounter this error, you can easily fix it by adding the following annotation to any of your application classes (or you can create a new class such as `Reflections` just to host this annotation if you prefer):
ja_jp: このエラーが発生した場合は、アプリケーションクラスに以下のアノテーションを追加することで、簡単に修正することができます（あるいは、このアノテーションをホストするためだけに、 `Reflections` のような新しいクラスを作成することもできます）。

source: When you encounter this error, you can easily fix it by adding the following annotation to any of your application classes (or you can create a new class, such as `Reflections` just to host this annotation if you prefer):
ja_jp: このエラーが発生した場合は、アプリケーションクラスのいずれかに次のアノテーションを追加することで簡単に修正できます (または、必要に応じて、このアノテーションをホストするためだけに `Reflections` のような新しいクラスを作成することもできます)。

source: When you get (from a parameter or from a method you called) a `Uni` or a `Multi`, whether you should subscribe to it depends on the context:
ja_jp: `Uni` または `Multi` を (パラメーターまたは呼び出したメソッドから) 取得する場合、それをサブスクライブするかどうかはコンテキストによって異なります。

source: When you have both the authorization code and xref:security-oidc-bearer-token-authentication.adoc[bearer access token] flows supported by xref:security-openid-connect-multitenancy.adoc[multiple OIDC tenants] and the filters have to deal with a flow-specific logic, you can instead have them restricted to the authorization code flow with the `io.quarkus.oidc.AuthorizationCodeFlow` annotation and xref:security-oidc-bearer-token-authentication.adoc#restrict-oidc-filter-to-bearer-auth-flow[the bearer access token flow with the 'io.quarkus.oidc.BearerTokenAuthentication' annotation].
ja_jp: xref:security-openid-connect-multitenancy.adoc[複数の OIDC テナント] によって、認可コードフローと xref:security-oidc-bearer-token-authentication.adoc[ベアラーアクセストークン] フローの両方がサポートされており、フィルターがフロー固有のロジックを処理する必要がある場合、代わりにそれらを `io.quarkus.oidc.AuthorizationCodeFlow` アノテーションを使用して認可コードフローに、および xref:security-oidc-bearer-token-authentication.adoc#restrict-oidc-filter-to-bearer-auth-flow[『io.quarkus.oidc.BearerTokenAuthentication』アノテーションを使用してベアラーアクセストークンフローに] 制限できます。

source: When you have both the bearer access token and xref:security-oidc-code-flow-authentication.adoc[authorization code] flows supported by xref:security-openid-connect-multitenancy.adoc[multiple OIDC tenants] and the filters have to deal with a flow specific logic, you can instead have them restricted to the bearer token flow with the `io.quarkus.oidc.BearerTokenAuthentication` annotation and xref:security-oidc-code-flow-authentication.adoc#restrict-oidc-filter-to-code-flow[the authorization code flow with the 'io.quarkus.oidc.AuthorizationCodeFlow' annotation].
ja_jp: 「ベアラーアクセストークン」と xref:security-oidc-code-flow-authentication.adoc[認可コード] の両フローが xref:security-openid-connect-multitenancy.adoc[複数の OIDC テナント] でサポートされており、フィルターがフロー固有のロジックを処理する必要がある場合、代わりに `io.quarkus.oidc.BearerTokenAuthentication` アノテーションでベアラートークンフローに制限するか、xref:security-oidc-code-flow-authentication.adoc#restrict-oidc-filter-to-code-flow[「io.quarkus.oidc.AuthorizationCodeFlow」アノテーションで認可コードフローに制限する] ことができます。

source: When you have multiple client interceptors, you can order them by implementing the `jakarta.enterprise.inject.spi.Prioritized` interface:
ja_jp: 複数のクライアントインターセプターがある場合、 `jakarta.enterprise.inject.spi.Prioritized` インターフェースを実装することで、順番に並べることができます:

source: When you have multiple client interceptors, you can order them by implementing the `javax.enterprise.inject.spi.Prioritized` interface:
ja_jp: 複数のクライアント・インターセプターがある場合、 `javax.enterprise.inject.spi.Prioritized` インターフェイスを実装することで、それらのインターセプターを指定することができます。
